[
    {
    "id": 3,
    "title": "Stop buying things you don't need.",
    "excerpt": "Ever stood at the checkout counter, shocked by the total on the display? We've all been there. Here's why we keep overspending:",
     "content":"## Ever stood at the checkout counter, shocked by the total on the display?  We've all been there.\n\n \n## Here's why we keep overspending:\n\n## 1. Shopping Without a Plan\n\n- Shopping without a clear list invites endless possibilities of items landing in your cart. You might have a few things in mind that you want to buy, but without defining them clearly beforehand, you'll likely end up with unnecessary purchases. \n\n Writing down what you need prior to shopping can save you time and limit your spending.\n\n## 2. Collecting Offers\n\n-While walking through aisles and shelves, you start noticing those eye-catching yellow and red papers advertising limited-time offers. Suddenly, you realize what a great opportunity this is, and without a second thought, the item finds its way into your shopping cart. \n\n Oddly enough, when you stepped into the store, this wasn't even something you planned to buy.\n\n## 3. Falling for the \"Buy More, Save More\" Trap\n\n- You see a sign: \"Buy 3, get 1 free!\" Sounds awesome, right? But do you really need three of those items? Stores are clever in pushing us to believe we're saving money, when in reality, we're just buying more than what we need. \n\n If you weren't planning to buy that much, it's not a deal.\n\n## 4. Using Shopping as Therapy\n\n- Had a rough week? Shopping might seem like a quick fix to boost your mood. But that short-lived excitement while browsing goods fades quickly, and you're left with less money and more stuff you don't need.\n\n Using shopping as therapy might feel good at the moment, but it's not worth the financial stress later.\n\nBy being aware of these common traps, you can take charge of your spending and stop buying things you don't need. Planning ahead and sticking to your list can help you shop with a new mindset.\n\n> This approach aligns with insights from *The Psychology of Money* by Morgan Housel, where he delves into how emotions, impulsivity, and psychological factors play a significant role in our spending habits. Housel highlights how seemingly great deals and shopping as therapy can actually lead to unnecessary financial strain. Understanding these behaviors can be a powerful tool for avoiding overspending and making smarter choices.",
    "date": "December 26, 2024",
    "author": "Abdulnasser",
    "thumbnail": "https://raw.githubusercontent.com/mrnassir1/blogs/refs/heads/main/images/The%20scene%20.webp"
  },
{
    "id": 1,
    "title": "You Can't Achieve Your Goals? You're Doing It Wrong...",
    "excerpt": "How many times have you set a goal, felt super motivated for a week or even less, and then watched it completely fall apart..",
    "content": "# Why This Matters to You?\n\nI'm going to share straightforward advice about why your goals keep slipping away, and how to make them happen this time.\n\n## The Goal-Setting Trap\n\n### 1. Setting Goals That Are Way Too Optimstic\n\nWe've all made these crazy plans. You decide you're going to:\n\n- Learn a whole new language in three months\n- Start a multi-million Riyal business overnight\n- Transform your body in one week\n\nReality check: These goals are impossible to tackle all at once. They're just too massive.\n\n### 2. The Procrastination Problem\n\nProcrastination isn't simply about laziness, it's often a response to feeling overwhelmed.\n When a goal seems impossible, your brain hesitates to start. Suddenly, watching a movie or scrolling through social media feels way more appealing than facing that big, scary goal.\n\n## Okay, How Do We Achieve Our Goals Then?\n\n### Make Your Goals Super Small\n\nHere's a game-changer: Start small that it feels almost ridiculous not to do it.\n\n- Want to get fit? Start with 10-minute walks\n- Hoping to write a book? Begin with 100 words a day\n- Dreaming of learning a language? Learn three new words daily\n\n### Goal-Setting Plan\n\n- Start small\n- Keep it simple\n- Make it incredibly easy\n- Celebrate every tiny win\n\n## The Real Secret\n\n> \"Success is the sum of small efforts, repeated day in and day out.\"\n> - Robert Collier, 1885\n\n**Are you ready to turn your dreams into reality?**",
    "date": "December 15, 2024",
    "author": "Abdulnasser",
    "thumbnail": "https://raw.githubusercontent.com/mrnassir1/blogs/refs/heads/main/images/938610a7-13ed-475b-a9e8-50d63eb8061f.webp"
},
{
    "id": 2,
    "title": "Demo",
    "excerpt": "Demo",
     "content":"demo",
    "date": "December 12, 2024",
    "author": "..",
    "thumbnail": "https://imgs.search.brave.com/H3mLk58AVBKlAzkz_7-zPxLZxLDZzSDLoQlqQ2pCqdM/rs:fit:860:0:0:0/g:ce/aHR0cHM6Ly90My5m/dGNkbi5uZXQvanBn/LzA5Lzc2LzE0Lzc0/LzM2MF9GXzk3NjE0/NzQzNl9Xd0J3OW9E/MHZzWjN1UndtSWcx/aWVJbFVqaVhZSEI4/dS5qcGc"
  }
]
